In [1]:
import pandas as pd

In [2]:
apel = pd.Series([5,2,0,1])

In [3]:
jeruk = pd.Series([0,3,8,2], index=[1,2,3,4])

In [6]:
apel[1]
jeruk[2]

3

In [8]:
df1 = pd.DataFrame([5,2,0,1], columns=['apel'])
apel

0    5
1    2
2    0
3    1
dtype: int64

In [9]:
dict1 = {
    'apel': [5,2,0,1],
    'jeruk': [0,3,8,2]
}
df1 = pd.DataFrame(dict1)
df1

   apel  jeruk
0     5      0
1     2      3
2     0      8
3     1      2

In [10]:
# untuk menghitung jumblah data
df1.count()

apel     4
jeruk    4
dtype: int64

In [11]:
# untuk menghitung jumblah keseluruhan semua nilai
df1.sum()

apel      8
jeruk    13
dtype: int64

In [12]:
# fungsi describe() yg dpt menampilkan statistik singat tentang dataset
df1.describe()

           apel    jeruk
count  4.000000  4.00000
mean   2.000000  3.25000
std    2.160247  3.40343
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.750000  4.25000
max    5.000000  8.00000

In [ ]:
# mengambil subset dari dataframe
# dgn series:
apel = df1.apel
# atau
# apel = df1.['apel']
# jeruk_apel = df1['jeruk','apel']

In [13]:
df1[0:2]

   apel  jeruk
0     5      0
1     2      3

In [14]:
df1[2:]

   apel  jeruk
2     0      8
3     1      2

In [15]:
# perbandingan di dataframe
df1['jeruk']>2

0    False
1     True
2     True
3    False
Name: jeruk, dtype: bool

In [16]:
# menampilkan baris-baris yg memenuhi syarat(true) ke layar
df1[df1['jeruk']>2]

   apel  jeruk
1     2      3
2     0      8

In [18]:
# head() dipakai utk membaca beberapa baris pertama saja.
df1.head(2)

   apel  jeruk
0     5      0
1     2      3

In [19]:
# ini dinamakan transpose
df1.T

       0  1  2  3
apel   5  2  0  1
jeruk  0  3  8  2

In [23]:
# mengambil data dgn operator iloc(dgn angka) atau dgn loc(dgn nama index)
df1.iloc[3]

apel     1
jeruk    2
Name: 3, dtype: int64

In [24]:
df1.iloc[[1,3]]

   apel  jeruk
1     2      3
3     1      2

In [39]:
df2 = pd.DataFrame(dict1, index=['a','b','c','d'])
df2

   apel  jeruk
a     5      0
b     2      3
c     0      8
d     1      2

In [28]:
# mengambil data dgn operator loc(dgn nama index)
df2.loc['c']

apel     0
jeruk    8
Name: c, dtype: int64

In [36]:
# fungsi drop() menghapus baris dgn index yang di sebutkan
df3 = df2.drop('b')
df3

   apel
a     5
b     2
c     0
d     1

In [34]:
"""kita  bisa menambahkan opsi inplance=True agar operasi drop() terhadap
DataFrame langsung mengubah isi DataFrame aslinya"""
# df2.drop('b', inplace=True)

'kita  bisa menambahkan opsi inplance=True agar operasi drop() terhadap\nDataFrame langsung mengubah isi DataFrame aslinya'

In [43]:
# cara menghapus seluruh isi sebuah kolom dgn axis=
df4 = df2.drop('jeruk', axis=1)
df4

   apel
a     5
b     2
c     0
d     1

In [49]:
""" fungsi duplicated() yng disediakan pandas bisa sangat membantu untuk mencari 
data-data yg muncul lebih dari sekali di DataFrame"""
df5 = pd.DataFrame([1,2,2,3,4,5,5,5,6,7], columns=['nilai'])

df5.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [51]:
# fungsi drop_duplicates() utk menghapus data duplikat
df6 = df5.drop_duplicates(keep='first')
""" 
fungsi keep='first' digunakan utk memberitahu pandas bahwa 
data duplikat selain yang paling awal ditemukan di dalam DataFrame.
fungsi keep-'last' akan menghapus semua baris duplikat selain baris 
yg terakhir ditemukan.
"""

df6

   nilai
0      1
1      2
3      3
4      4
5      5
8      6
9      7

In [53]:
"""
hanya ingin membuang duplikasi dari satu kolom tertentu
(bila DataFrame memiliki banyak kolom), maka nama kolom harus di sebut
"""
df7 = df5.drop_duplicates(['nilai'], keep='first')
df7

   nilai
0      1
1      2
3      3
4      4
5      5
8      6
9      7

In [55]:
df8 = pd.DataFrame([1,2,None,4,5,None], columns=['nilai'])
df8

   nilai
0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN

In [56]:
# NaN adalah not a number
"""
jika ingin membuang data yg kosong, mengunakan fungsi dropna()
"""
df9 = df8.dropna()
df9

   nilai
0    1.0
1    2.0
3    4.0
4    5.0

In [57]:
""" 
funsi fillna() akan mengisi semua data yg kosong dgn angka yg dimau
"""
df10 = df8.fillna(999)
df10

   nilai
0    1.0
1    2.0
2  999.0
3    4.0
4    5.0
5  999.0

In [4]:
""" 
fungsi loc() digunakan utk keperluan if-else
"""
df1 = pd.DataFrame([1,2,3,4,5,6,7,8], columns=['nilai'])
df1.loc[df1['nilai'] >= 5, "kelulusan"] = 'Lulus'
df1.loc[df1['nilai'] < 5, "kelulusan"] = 'Gagal'
df1

   nilai kelulusan
0      1     Gagal
1      2     Gagal
2      3     Gagal
3      4     Gagal
4      5     Lulus
5      6     Lulus
6      7     Lulus
7      8     Lulus

In [ ]:
# df1 = pd.read_csv("C:\\nama_file.csv")
# untuk membaca file

# df1 = pd.read_csv("C:\\nama_file.csv", usecol=range(5))
# untuk menentukan sendiri jumblah kolom yang di ambil

# df1 = pd.read_csv("C:\\nama_file.csv", header=None)
# utk tdk menganggap baris pertama sebagai header, namun sebagai data biasa

# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'])
# utk menentukan sendiri nama kolom dalam DataFrame

# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'], index_cool='a')
# bilamana ingin menggunakan salah satu kolom di dalam DataFrame sebagai index

""" 
pandas secara otomatis akan berhenti membaca file bilamenemui file yg isinya tdk konsisten,
misalnya ada baris yg jumlah kolomnya tdk sama dgn baris-baris lainnya.
"""
# df1 = pd.read_csv("C:\\nama_file.csv", error_bad_lines="False")


""" 
utk mencegah proses pembacaan file yg terlalu panjang atau tdk cukup
masuk ke memory komputer yg tersedia.
"""
# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'], nrows=1000)